In [1]:
import pandas as pd

In [13]:
cols = ['Id','Datetime','Latitude','Longitude']
df = pd.read_csv('./1.txt',names=cols)

In [15]:
df.head()

   Id             Datetime   Latitude  Longitude
0   1  2008-02-02 15:36:08  116.51172   39.92123
1   1  2008-02-02 15:46:08  116.51135   39.93883
2   1  2008-02-02 15:46:08  116.51135   39.93883
3   1  2008-02-02 15:56:08  116.51627   39.91034
4   1  2008-02-02 16:06:08  116.47186   39.91248

In [16]:
from datetime import datetime
now = datetime.now()
timestamp = datetime.timestamp(now)
print("timestamp =", timestamp)

timestamp = 1575452230.847318

In [20]:
str = df['Datetime'][0]

In [21]:
print(str)

2008-02-02 15:36:08

In [24]:
date_time_obj = datetime.strptime(str, '%Y-%m-%d %H:%M:%S')

In [25]:
print(date_time_obj)

2008-02-02 15:36:08

In [26]:
ts = datetime.timestamp(date_time_obj)

In [27]:
print(ts)

1201946768.0

In [30]:
df['Timestamp'] = datetime.timestamp(datetime.strptime(df['Datetime'], '%Y-%m-%d %H:%M:%S'))

TypeError: strptime() argument 1 must be str, not Series

In [32]:
df.Datetime.dtype

dtype('O')

In [34]:
df['Datetime'] =  pd.to_datetime(df['Datetime'], format='%Y-%m-%d %H:%M:%S')

In [35]:
df.Datetime.dtype

dtype('<M8[ns]')

In [36]:
df['Datetime'][0]

Timestamp('2008-02-02 15:36:08')

In [37]:
print(datetime.timestamp(df['Datetime'][0]))

1201946768.0

In [39]:
df.head()

   Id            Datetime   Latitude  Longitude
0   1 2008-02-02 15:36:08  116.51172   39.92123
1   1 2008-02-02 15:46:08  116.51135   39.93883
2   1 2008-02-02 15:46:08  116.51135   39.93883
3   1 2008-02-02 15:56:08  116.51627   39.91034
4   1 2008-02-02 16:06:08  116.47186   39.91248

In [41]:
df['Timestamp']=df['Datetime']

In [42]:
df.head()

   Id            Datetime   Latitude  Longitude           Timestamp
0   1 2008-02-02 15:36:08  116.51172   39.92123 2008-02-02 15:36:08
1   1 2008-02-02 15:46:08  116.51135   39.93883 2008-02-02 15:46:08
2   1 2008-02-02 15:46:08  116.51135   39.93883 2008-02-02 15:46:08
3   1 2008-02-02 15:56:08  116.51627   39.91034 2008-02-02 15:56:08
4   1 2008-02-02 16:06:08  116.47186   39.91248 2008-02-02 16:06:08

In [45]:
def function(row):
    return datetime.timestamp(row['Timestamp'])

In [46]:
df['Timestamp'] = df.apply(function,axis=1)

In [47]:
df.head()

   Id            Datetime   Latitude  Longitude     Timestamp
0   1 2008-02-02 15:36:08  116.51172   39.92123  1.201947e+09
1   1 2008-02-02 15:46:08  116.51135   39.93883  1.201947e+09
2   1 2008-02-02 15:46:08  116.51135   39.93883  1.201947e+09
3   1 2008-02-02 15:56:08  116.51627   39.91034  1.201948e+09
4   1 2008-02-02 16:06:08  116.47186   39.91248  1.201949e+09